# GetDGNExportOptions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportDGNSettings..::..GetDGNExportOptions Method
ExportDGNSettings Class See Also
---
Gets the options stored in the these settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public DGNExportOptions GetDGNExportOptions()
```

Visual Basic
---
```text
Public Function GetDGNExportOptions As DGNExportOptions
```

Visual C++
---
```text
public:
DGNExportOptions^ GetDGNExportOptions()
```

# ### Return Value
The options.
# See Also
ExportDGNSettings Class
Autodesk.Revit.DB Namespace